{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "BatchNormalization", "config": {"batch_input_shape": [null, 75, 320, 3], "beta_regularizer": null, "axis": -1, "mode": 0, "epsilon": 0.001, "trainable": true, "input_dtype": "float32", "momentum": 0.99, "gamma_regularizer": null, "name": "batchnormalization_1"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "border_mode": "valid", "nb_filter": 24, "name": "convolution2d_1", "b_regularizer": null, "trainable": true, "nb_row": 5, "nb_col": 5, "init": "glorot_uniform", "bias": true, "W_constraint": null, "subsample": [2, 2], "activation": "linear", "W_regularizer": null, "activity_regularizer": null, "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_1", "strides": [1, 1], "trainable": true, "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "border_mode": "valid", "nb_filter": 36, "name": "convolution2d_2", "b_regularizer": null, "trainable": true, "nb_row": 5, "nb_col": 5, "init": "glorot_uniform", "bias": true, "W_constraint": null, "subsample": [2, 2], "activation": "linear", "W_regularizer": null, "activity_regularizer": null, "b_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_2"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "border_mode": "valid", "nb_filter": 48, "name": "convolution2d_3", "b_regularizer": null, "trainable": true, "nb_row": 5, "nb_col": 5, "init": "glorot_uniform", "bias": true, "W_constraint": null, "subsample": [2, 2], "activation": "linear", "W_regularizer": null, "activity_regularizer": null, "b_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "border_mode": "valid", "nb_filter": 64, "name": "convolution2d_4", "b_regularizer": null, "trainable": true, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "bias": true, "W_constraint": null, "subsample": [1, 1], "activation": "linear", "W_regularizer": null, "activity_regularizer": null, "b_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "border_mode": "valid", "nb_filter": 64, "name": "convolution2d_5", "b_regularizer": null, "trainable": true, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "bias": true, "W_constraint": null, "subsample": [1, 1], "activation": "linear", "W_regularizer": null, "activity_regularizer": null, "b_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_5"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"output_dim": 1000, "input_dim": 4224, "b_constraint": null, "name": "dense_1", "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "bias": true, "W_constraint": null, "activation": "linear", "trainable": true, "activity_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_6"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"output_dim": 500, "input_dim": 1000, "b_constraint": null, "name": "dense_2", "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "bias": true, "W_constraint": null, "activation": "linear", "trainable": true, "activity_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_7"}}, {"class_name": "Dense", "config": {"output_dim": 1, "input_dim": 500, "b_constraint": null, "name": "dense_3", "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "bias": true, "W_constraint": null, "activation": "linear", "trainable": true, "activity_regularizer": null}}]}