{"class_name": "Sequential", "config": [{"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "batch_input_shape": [null, 75, 320, 3], "momentum": 0.99, "epsilon": 0.001, "input_dtype": "float32", "mode": 0, "name": "batchnormalization_1", "axis": -1, "trainable": true, "beta_regularizer": null}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "nb_filter": 24, "trainable": true, "bias": true, "nb_row": 5, "W_constraint": null, "name": "convolution2d_1", "b_regularizer": null, "activity_regularizer": null, "subsample": [2, 2], "W_regularizer": null, "b_constraint": null, "border_mode": "valid", "init": "glorot_uniform", "activation": "linear", "dim_ordering": "tf"}}, {"class_name": "MaxPooling2D", "config": {"strides": [1, 1], "trainable": true, "border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_1", "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"name": "elu_1", "trainable": true, "alpha": 1.0}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.25, "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "nb_filter": 36, "trainable": true, "bias": true, "nb_row": 5, "W_constraint": null, "name": "convolution2d_2", "b_regularizer": null, "activity_regularizer": null, "subsample": [2, 2], "W_regularizer": null, "b_constraint": null, "border_mode": "valid", "init": "glorot_uniform", "activation": "linear", "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"name": "elu_2", "trainable": true, "alpha": 1.0}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.25, "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "nb_filter": 48, "trainable": true, "bias": true, "nb_row": 5, "W_constraint": null, "name": "convolution2d_3", "b_regularizer": null, "activity_regularizer": null, "subsample": [2, 2], "W_regularizer": null, "b_constraint": null, "border_mode": "valid", "init": "glorot_uniform", "activation": "linear", "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"name": "elu_3", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "nb_filter": 64, "trainable": true, "bias": true, "nb_row": 3, "W_constraint": null, "name": "convolution2d_4", "b_regularizer": null, "activity_regularizer": null, "subsample": [1, 1], "W_regularizer": null, "b_constraint": null, "border_mode": "valid", "init": "glorot_uniform", "activation": "linear", "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"name": "elu_4", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "nb_filter": 64, "trainable": true, "bias": true, "nb_row": 3, "W_constraint": null, "name": "convolution2d_5", "b_regularizer": null, "activity_regularizer": null, "subsample": [1, 1], "W_regularizer": null, "b_constraint": null, "border_mode": "valid", "init": "glorot_uniform", "activation": "linear", "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"name": "elu_5", "trainable": true, "alpha": 1.0}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "bias": true, "W_constraint": null, "name": "dense_1", "b_regularizer": null, "input_dim": 4224, "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "activation": "linear", "output_dim": 100}}, {"class_name": "ELU", "config": {"name": "elu_6", "trainable": true, "alpha": 1.0}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "bias": true, "W_constraint": null, "name": "dense_2", "b_regularizer": null, "input_dim": 100, "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "activation": "linear", "output_dim": 50}}, {"class_name": "ELU", "config": {"name": "elu_7", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"trainable": true, "bias": true, "W_constraint": null, "name": "dense_3", "b_regularizer": null, "input_dim": 50, "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "activation": "linear", "output_dim": 21}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "softmax"}}], "keras_version": "1.2.1"}